*** crates/ajave-models/src/lib.rs:1648:9: delete match arm "java/lang/Integer" in is_total_jdk_signature

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/lang/Integer" in is_total_jdk_signature
@@ -1640,31 +1640,17 @@
                 | ("toUpperCase", "()Ljava/lang/String;")
                 | ("toLowerCase", "()Ljava/lang/String;")
                 // `equals` is null-tolerant by contract (returns false).
                 | ("equals", "(Ljava/lang/Object;)Z")
         ),
 
         // Unboxing accessors are total. `valueOf` only for the *primitive*
         // overloads — the `String` ones throw `NumberFormatException`.
-        "java/lang/Integer" => matches!(
-            (name, desc),
-            ("intValue", "()I")
-                | ("longValue", "()J")
-                | ("doubleValue", "()D")
-                | ("floatValue", "()F")
-                | ("shortValue", "()S")
-                | ("byteValue", "()B")
-                | ("hashCode", "()I")
-                | ("toString", "()Ljava/lang/String;")
-                | ("equals", "(Ljava/lang/Object;)Z")
-                | ("valueOf", "(I)Ljava/lang/Integer;")
-                | ("toString", "(I)Ljava/lang/String;")
-                | ("compare", "(II)I")
-        ),
+         /* ~ changed by cargo-mutants ~ */
         "java/lang/Long" => matches!(
             (name, desc),
             ("intValue", "()I")
                 | ("longValue", "()J")
                 | ("doubleValue", "()D")
                 | ("floatValue", "()F")
                 | ("shortValue", "()S")
                 | ("byteValue", "()B")

*** result: Success
