*** crates/ajave-models/src/lib.rs:1071:5: replace pure_owner_member_may_throw -> bool with true

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace pure_owner_member_may_throw -> bool with true
@@ -1063,90 +1063,17 @@
 
 /// `true` for members of `PURE_OWNERS` classes that can raise a
 /// `RuntimeException`, and so must not be modelled as pure.
 ///
 /// Keyed on the descriptor where overloads differ in totality —
 /// `Integer.valueOf(int)` is total, `Integer.valueOf(String)` throws
 /// `NumberFormatException`.
 fn pure_owner_member_may_throw(owner: &str, name: &str, desc: &str) -> bool {
-    match owner {
-        // Overflow (`*Exact`) and zero-divisor (`floorDiv`/`floorMod`) checks.
-        "java/lang/Math" | "java/lang/StrictMath" => matches!(
-            name,
-            "addExact"
-                | "subtractExact"
-                | "multiplyExact"
-                | "incrementExact"
-                | "decrementExact"
-                | "negateExact"
-                | "absExact"
-                | "toIntExact"
-                | "floorDiv"
-                | "floorMod"
-                | "ceilDiv"
-                | "ceilMod"
-                | "divideExact"
-        ),
-        // Monitor operations. All three throw `IllegalMonitorStateException`
-        // unless the caller owns the monitor, and `wait` also throws
-        // `InterruptedException`.
-        //
-        // Keeping them out of `Pure` matters for a second reason beyond
-        // throwing: `Pure` *erases* the call, and a void one disappears from
-        // the IR entirely. A `wait()` that is not in the IR cannot block, so a
-        // thread that waits forever appears to terminate and a program that
-        // provably hangs is reported deadlock-free — the same shape as the
-        // `System.arraycopy` disappearance in issue #49, which is why that
-        // entry sits directly below.
-        "java/lang/Object" => matches!(name, "wait" | "notify" | "notifyAll"),
-        // IndexOutOfBounds / ArrayStore / NPE.
-        "java/lang/System" => name == "arraycopy",
-        // Boxing from a String parses, and parsing throws.
-        "java/lang/Integer" | "java/lang/Long" | "java/lang/Short" | "java/lang/Byte"
-        | "java/lang/Float" | "java/lang/Double" => {
-            name == "valueOf" && desc.starts_with("(Ljava/lang/String;)")
-        }
-        // Bounds and comparator contracts.
-        "java/util/Arrays" => matches!(
-            name,
-            "copyOfRange" | "fill" | "sort" | "binarySearch" | "asList" | "setAll"
-        ),
-        // `max`/`min` throw on an empty collection; `nCopies` on a negative count.
-        "java/util/Collections" => matches!(
-            name,
-            "max"
-                | "min"
-                | "nCopies"
-                | "unmodifiableList"
-                | "unmodifiableMap"
-                | "unmodifiableSet"
-                | "sort"
-                | "binarySearch"
-        ),
-        // Partial by contract: out-of-range index, empty receiver, null key.
-        "java/util/List"
-        | "java/util/ArrayList"
-        | "java/util/LinkedList"
-        | "java/util/AbstractList" => matches!(name, "get" | "set" | "remove" | "add"),
-        "java/util/Map"
-        | "java/util/HashMap"
-        | "java/util/TreeMap"
-        | "java/util/LinkedHashMap"
-        | "java/util/AbstractMap" => {
-            // Sorted maps throw on null/incomparable keys; the hash maps do not,
-            // but `TreeMap` shares this owner set, so stay conservative.
-            matches!(name, "put" | "get" | "remove")
-        }
-        "java/util/TreeSet" | "java/util/Set" => matches!(name, "add" | "first" | "last"),
-        "java/util/Iterator" | "java/util/ListIterator" => {
-            matches!(name, "next" | "previous" | "remove")
-        }
-        _ => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Match boxing (`valueOf`) and unboxing (`*Value()`) methods on wrapper types.
 fn box_model(owner: &str, name: &str, desc: &str) -> Option<CallModel> {
     match owner {
         "java/lang/Boolean" => match name {
             "valueOf" if desc == "(Z)Ljava/lang/Boolean;" => Some(CallModel::BoxStore(Ty::Int)),
             "booleanValue" if desc == "()Z" => Some(CallModel::Unbox(Ty::Int)),

*** result: Success
