*** crates/ajave-models/src/lib.rs:1705:9: delete match arm "java/lang/Float" in is_total_jdk_signature

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/lang/Float" in is_total_jdk_signature
@@ -1697,31 +1697,17 @@
                 | ("floatValue", "()F")
                 | ("shortValue", "()S")
                 | ("hashCode", "()I")
                 | ("toString", "()Ljava/lang/String;")
                 | ("equals", "(Ljava/lang/Object;)Z")
                 | ("valueOf", "(B)Ljava/lang/Byte;")
         ),
         // Float/Double parsing throws; the accessors and primitive boxing do not.
-        "java/lang/Float" => matches!(
-            (name, desc),
-            ("floatValue", "()F")
-                | ("doubleValue", "()D")
-                | ("intValue", "()I")
-                | ("longValue", "()J")
-                | ("shortValue", "()S")
-                | ("byteValue", "()B")
-                | ("hashCode", "()I")
-                | ("toString", "()Ljava/lang/String;")
-                | ("equals", "(Ljava/lang/Object;)Z")
-                | ("valueOf", "(F)Ljava/lang/Float;")
-                | ("isNaN", "(F)Z")
-                | ("isInfinite", "(F)Z")
-        ),
+         /* ~ changed by cargo-mutants ~ */
         "java/lang/Double" => matches!(
             (name, desc),
             ("doubleValue", "()D")
                 | ("floatValue", "()F")
                 | ("intValue", "()I")
                 | ("longValue", "()J")
                 | ("shortValue", "()S")
                 | ("byteValue", "()B")

*** result: Success
