*** crates/ajave-models/src/lib.rs:1737:9: delete match arm "java/lang/Boolean" in is_total_jdk_signature

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/lang/Boolean" in is_total_jdk_signature
@@ -1729,25 +1729,17 @@
                 | ("toString", "()Ljava/lang/String;")
                 | ("equals", "(Ljava/lang/Object;)Z")
                 | ("valueOf", "(D)Ljava/lang/Double;")
                 | ("isNaN", "(D)Z")
                 | ("isInfinite", "(D)Z")
         ),
         // `parseBoolean`/`valueOf(String)` are null-tolerant by contract here:
         // they return false rather than throwing.
-        "java/lang/Boolean" => matches!(
-            (name, desc),
-            ("booleanValue", "()Z")
-                | ("hashCode", "()I")
-                | ("toString", "()Ljava/lang/String;")
-                | ("equals", "(Ljava/lang/Object;)Z")
-                | ("valueOf", "(Z)Ljava/lang/Boolean;")
-                | ("parseBoolean", "(Ljava/lang/String;)Z")
-        ),
+         /* ~ changed by cargo-mutants ~ */
         "java/lang/Character" => matches!(
             (name, desc),
             ("charValue", "()C") | ("hashCode", "()I")
                 | ("toString", "()Ljava/lang/String;")
                 | ("equals", "(Ljava/lang/Object;)Z")
                 | ("valueOf", "(C)Ljava/lang/Character;")
                 // Classification predicates are total over the whole char range.
                 | ("isDigit", "(C)Z") | ("isLetter", "(C)Z")

---- smt_bmc::explore::jdk_allowlist_tests::total_signatures_are_allowlisted stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::total_signatures_are_allowlisted' (49934950) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:1953:13:
java/lang/Boolean.parseBoolean(Ljava/lang/String;)Z is total but is not allowlisted — costs precision

failures:
    smt_bmc::explore::jdk_allowlist_tests::total_signatures_are_allowlisted

test result: FAILED. 54 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
