*** crates/ajave-models/src/lib.rs:1746:9: delete match arm "java/lang/Character" in is_total_jdk_signature

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/lang/Character" in is_total_jdk_signature
@@ -1738,29 +1738,17 @@
             (name, desc),
             ("booleanValue", "()Z")
                 | ("hashCode", "()I")
                 | ("toString", "()Ljava/lang/String;")
                 | ("equals", "(Ljava/lang/Object;)Z")
                 | ("valueOf", "(Z)Ljava/lang/Boolean;")
                 | ("parseBoolean", "(Ljava/lang/String;)Z")
         ),
-        "java/lang/Character" => matches!(
-            (name, desc),
-            ("charValue", "()C") | ("hashCode", "()I")
-                | ("toString", "()Ljava/lang/String;")
-                | ("equals", "(Ljava/lang/Object;)Z")
-                | ("valueOf", "(C)Ljava/lang/Character;")
-                // Classification predicates are total over the whole char range.
-                | ("isDigit", "(C)Z") | ("isLetter", "(C)Z")
-                | ("isLetterOrDigit", "(C)Z") | ("isWhitespace", "(C)Z")
-                | ("isUpperCase", "(C)Z") | ("isLowerCase", "(C)Z")
-                | ("isAlphabetic", "(I)Z") | ("isSpaceChar", "(C)Z")
-                | ("toUpperCase", "(C)C") | ("toLowerCase", "(C)C")
-        ),
+         /* ~ changed by cargo-mutants ~ */
 
         // Explicitly enumerated: the `*Exact` family throws `ArithmeticException`
         // on overflow, and `floorDiv`/`floorMod`/`ceilDiv` throw on a zero
         // divisor. The listed methods saturate to NaN/Infinity instead.
         "java/lang/Math" | "java/lang/StrictMath" => matches!(
             name,
             "abs"
                 | "min"

---- smt_bmc::explore::jdk_allowlist_tests::total_signatures_are_allowlisted stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::total_signatures_are_allowlisted' (49938324) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:1953:13:
java/lang/Character.isDigit(C)Z is total but is not allowlisted — costs precision

failures:
    smt_bmc::explore::jdk_allowlist_tests::total_signatures_are_allowlisted

test result: FAILED. 54 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
