*** crates/ajave-models/src/lib.rs:1109:9: delete match arm "java/util/Arrays" in pure_owner_member_may_throw

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/util/Arrays" in pure_owner_member_may_throw
@@ -1101,20 +1101,17 @@
         // IndexOutOfBounds / ArrayStore / NPE.
         "java/lang/System" => name == "arraycopy",
         // Boxing from a String parses, and parsing throws.
         "java/lang/Integer" | "java/lang/Long" | "java/lang/Short" | "java/lang/Byte"
         | "java/lang/Float" | "java/lang/Double" => {
             name == "valueOf" && desc.starts_with("(Ljava/lang/String;)")
         }
         // Bounds and comparator contracts.
-        "java/util/Arrays" => matches!(
-            name,
-            "copyOfRange" | "fill" | "sort" | "binarySearch" | "asList" | "setAll"
-        ),
+         /* ~ changed by cargo-mutants ~ */
         // `max`/`min` throw on an empty collection; `nCopies` on a negative count.
         "java/util/Collections" => matches!(
             name,
             "max"
                 | "min"
                 | "nCopies"
                 | "unmodifiableList"
                 | "unmodifiableMap"

*** result: Success
