*** crates/ajave-models/src/lib.rs:1130:9: delete match arm "java/util/Map" | "java/util/HashMap" | "java/util/TreeMap" | "java/util/LinkedHashMap" | "java/util/AbstractMap" in pure_owner_member_may_throw

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/util/Map" | "java/util/HashMap" | "java/util/TreeMap" | "java/util/LinkedHashMap" | "java/util/AbstractMap" in pure_owner_member_may_throw
@@ -1122,25 +1122,17 @@
                 | "sort"
                 | "binarySearch"
         ),
         // Partial by contract: out-of-range index, empty receiver, null key.
         "java/util/List"
         | "java/util/ArrayList"
         | "java/util/LinkedList"
         | "java/util/AbstractList" => matches!(name, "get" | "set" | "remove" | "add"),
-        "java/util/Map"
-        | "java/util/HashMap"
-        | "java/util/TreeMap"
-        | "java/util/LinkedHashMap"
-        | "java/util/AbstractMap" => {
-            // Sorted maps throw on null/incomparable keys; the hash maps do not,
-            // but `TreeMap` shares this owner set, so stay conservative.
-            matches!(name, "put" | "get" | "remove")
-        }
+         /* ~ changed by cargo-mutants ~ */
         "java/util/TreeSet" | "java/util/Set" => matches!(name, "add" | "first" | "last"),
         "java/util/Iterator" | "java/util/ListIterator" => {
             matches!(name, "next" | "previous" | "remove")
         }
         _ => false,
     }
 }

*** result: Success
