*** crates/ajave-models/src/lib.rs:1149:5: replace box_model -> Option<CallModel> with None

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace box_model -> Option<CallModel> with None
@@ -1141,115 +1141,17 @@
             matches!(name, "next" | "previous" | "remove")
         }
         _ => false,
     }
 }
 
 /// Match boxing (`valueOf`) and unboxing (`*Value()`) methods on wrapper types.
 fn box_model(owner: &str, name: &str, desc: &str) -> Option<CallModel> {
-    match owner {
-        "java/lang/Boolean" => match name {
-            "valueOf" if desc == "(Z)Ljava/lang/Boolean;" => Some(CallModel::BoxStore(Ty::Int)),
-            "booleanValue" if desc == "()Z" => Some(CallModel::Unbox(Ty::Int)),
-            "logicalAnd" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::And)),
-            "logicalOr" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Or)),
-            "logicalXor" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Xor)),
-            "compare" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Sub)),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            _ => None,
-        },
-        "java/lang/Integer" => match name {
-            "valueOf" if desc == "(I)Ljava/lang/Integer;" => Some(CallModel::BoxStore(Ty::Int)),
-            "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
-            "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
-            "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
-            "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
-            "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" | "toHexString" | "toBinaryString" | "toOctalString"
-            | "toUnsignedString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            _ => None,
-        },
-        "java/lang/Long" => match name {
-            "valueOf" if desc == "(J)Ljava/lang/Long;" => Some(CallModel::BoxStore(Ty::Long)),
-            "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Long)),
-            "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Long)),
-            "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Long)),
-            "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Long)),
-            "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" | "toHexString" | "toBinaryString" | "toOctalString"
-            | "toUnsignedString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            _ => None,
-        },
-        "java/lang/Short" => match name {
-            "valueOf" if desc == "(S)Ljava/lang/Short;" => Some(CallModel::BoxStore(Ty::Int)),
-            "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
-            "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
-            "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
-            "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),
-            "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            _ => None,
-        },
-        "java/lang/Byte" => match name {
-            "valueOf" if desc == "(B)Ljava/lang/Byte;" => Some(CallModel::BoxStore(Ty::Int)),
-            "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),
-            "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
-            "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
-            "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
-            "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            _ => None,
-        },
-        "java/lang/Character" => match name {
-            "valueOf" if desc == "(C)Ljava/lang/Character;" => Some(CallModel::BoxStore(Ty::Int)),
-            "charValue" if desc == "()C" => Some(CallModel::Unbox(Ty::Int)),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            _ => None,
-        },
-        "java/lang/Double" => match name {
-            "valueOf" if desc == "(D)Ljava/lang/Double;" => Some(CallModel::BoxStore(Ty::Double)),
-            "doubleValue" if desc == "()D" => Some(CallModel::Unbox(Ty::Double)),
-            "intValue" if desc == "()I" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "longValue" if desc == "()J" => Some(CallModel::MathCall(Some(Ty::Long))),
-            "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            "isNaN" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "isInfinite" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "byteValue" if desc == "()B" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "shortValue" if desc == "()S" => Some(CallModel::MathCall(Some(Ty::Int))),
-            _ => None,
-        },
-        "java/lang/Float" => match name {
-            "valueOf" if desc == "(F)Ljava/lang/Float;" => Some(CallModel::BoxStore(Ty::Int)),
-            "floatValue" if desc == "()F" => Some(CallModel::Unbox(Ty::Int)),
-            "intValue" if desc == "()I" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "longValue" if desc == "()J" => Some(CallModel::MathCall(Some(Ty::Long))),
-            "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            "isNaN" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "isInfinite" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "byteValue" if desc == "()B" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "shortValue" if desc == "()S" => Some(CallModel::MathCall(Some(Ty::Int))),
-            _ => None,
-        },
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Check whether a Math/Integer/Long static method should be kept as a Call
 /// so the SMT engine can model it precisely instead of havocing.
 fn is_math_call(owner: &str, name: &str) -> bool {
     match owner {
         "java/lang/Math" | "java/lang/StrictMath" => matches!(
             name,

*** result: Success
