*** crates/ajave-models/src/lib.rs:1150:9: delete match arm "java/lang/Boolean" in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/lang/Boolean" in box_model
@@ -1142,27 +1142,17 @@
         }
         _ => false,
     }
 }
 
 /// Match boxing (`valueOf`) and unboxing (`*Value()`) methods on wrapper types.
 fn box_model(owner: &str, name: &str, desc: &str) -> Option<CallModel> {
     match owner {
-        "java/lang/Boolean" => match name {
-            "valueOf" if desc == "(Z)Ljava/lang/Boolean;" => Some(CallModel::BoxStore(Ty::Int)),
-            "booleanValue" if desc == "()Z" => Some(CallModel::Unbox(Ty::Int)),
-            "logicalAnd" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::And)),
-            "logicalOr" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Or)),
-            "logicalXor" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Xor)),
-            "compare" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Sub)),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            _ => None,
-        },
+         /* ~ changed by cargo-mutants ~ */
         "java/lang/Integer" => match name {
             "valueOf" if desc == "(I)Ljava/lang/Integer;" => Some(CallModel::BoxStore(Ty::Int)),
             "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
             "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),

*** result: Success
