*** crates/ajave-models/src/lib.rs:1151:31: replace == with != in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace == with != in box_model
@@ -1143,17 +1143,17 @@
         _ => false,
     }
 }
 
 /// Match boxing (`valueOf`) and unboxing (`*Value()`) methods on wrapper types.
 fn box_model(owner: &str, name: &str, desc: &str) -> Option<CallModel> {
     match owner {
         "java/lang/Boolean" => match name {
-            "valueOf" if desc == "(Z)Ljava/lang/Boolean;" => Some(CallModel::BoxStore(Ty::Int)),
+            "valueOf" if desc != /* ~ changed by cargo-mutants ~ */ "(Z)Ljava/lang/Boolean;" => Some(CallModel::BoxStore(Ty::Int)),
             "booleanValue" if desc == "()Z" => Some(CallModel::Unbox(Ty::Int)),
             "logicalAnd" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::And)),
             "logicalOr" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Or)),
             "logicalXor" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Xor)),
             "compare" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Sub)),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,

*** result: Success
