*** crates/ajave-models/src/lib.rs:1897:9: delete match arm "java/util/Iterator" in is_total_jdk_signature

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/util/Iterator" in is_total_jdk_signature
@@ -1889,17 +1889,17 @@
                 || matches!(
                     (name, desc),
                     ("size", "()I") | ("isEmpty", "()Z") | ("clear", "()V")
                 )
         }
 
         // `hasNext` is total; `next` throws `NoSuchElementException` when
         // exhausted and `remove` throws `IllegalStateException`.
-        "java/util/Iterator" => matches!((name, desc), ("hasNext", "()Z")),
+         /* ~ changed by cargo-mutants ~ */
         // `hasMoreElements` is to `Enumeration` what `hasNext` is to
         // `Iterator`: specified to report whether more elements remain, with no
         // failure mode. `nextElement` is deliberately absent -- it throws
         // NoSuchElementException when exhausted, and that is its contract, not
         // an edge case.
         "java/util/Enumeration" => matches!((name, desc), ("hasMoreElements", "()Z")),
         // `Collections` is not allowlisted as a class -- it has throwing
         // members like `max` on an empty collection. These construct or return

*** result: Success
