*** crates/ajave-models/src/lib.rs:1903:9: delete match arm "java/util/Enumeration" in is_total_jdk_signature

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/util/Enumeration" in is_total_jdk_signature
@@ -1895,17 +1895,17 @@
         // `hasNext` is total; `next` throws `NoSuchElementException` when
         // exhausted and `remove` throws `IllegalStateException`.
         "java/util/Iterator" => matches!((name, desc), ("hasNext", "()Z")),
         // `hasMoreElements` is to `Enumeration` what `hasNext` is to
         // `Iterator`: specified to report whether more elements remain, with no
         // failure mode. `nextElement` is deliberately absent -- it throws
         // NoSuchElementException when exhausted, and that is its contract, not
         // an edge case.
-        "java/util/Enumeration" => matches!((name, desc), ("hasMoreElements", "()Z")),
+         /* ~ changed by cargo-mutants ~ */
         // `Collections` is not allowlisted as a class -- it has throwing
         // members like `max` on an empty collection. These construct or return
         // a shared immutable instance and cannot fail.
         "java/util/Collections" => matches!(
             (name, desc),
             ("emptyList", "()Ljava/util/List;")
                 | ("emptySet", "()Ljava/util/Set;")
                 | ("emptyMap", "()Ljava/util/Map;")

---- smt_bmc::explore::jdk_allowlist_tests::enumeration_has_more_elements_is_total_but_next_element_is_not stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::enumeration_has_more_elements_is_total_but_next_element_is_not' (49971625) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:1981:9:
assertion failed: is_total_jdk_method("java/util/Enumeration", "hasMoreElements", "()Z")

failures:
    smt_bmc::explore::jdk_allowlist_tests::enumeration_has_more_elements_is_total_but_next_element_is_not

test result: FAILED. 54 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
