*** crates/ajave-models/src/lib.rs:1157:13: delete match arm "compareTo" in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "compareTo" in box_model
@@ -1149,17 +1149,17 @@
     match owner {
         "java/lang/Boolean" => match name {
             "valueOf" if desc == "(Z)Ljava/lang/Boolean;" => Some(CallModel::BoxStore(Ty::Int)),
             "booleanValue" if desc == "()Z" => Some(CallModel::Unbox(Ty::Int)),
             "logicalAnd" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::And)),
             "logicalOr" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Or)),
             "logicalXor" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Xor)),
             "compare" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Sub)),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
+             /* ~ changed by cargo-mutants ~ */
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
         "java/lang/Integer" => match name {
             "valueOf" if desc == "(I)Ljava/lang/Integer;" => Some(CallModel::BoxStore(Ty::Int)),
             "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),

*** result: Success
