*** crates/ajave-models/src/lib.rs:1161:9: delete match arm "java/lang/Integer" in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/lang/Integer" in box_model
@@ -1153,29 +1153,17 @@
             "logicalAnd" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::And)),
             "logicalOr" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Or)),
             "logicalXor" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Xor)),
             "compare" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Sub)),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
-        "java/lang/Integer" => match name {
-            "valueOf" if desc == "(I)Ljava/lang/Integer;" => Some(CallModel::BoxStore(Ty::Int)),
-            "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
-            "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
-            "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
-            "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
-            "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" | "toHexString" | "toBinaryString" | "toOctalString"
-            | "toUnsignedString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            _ => None,
-        },
+         /* ~ changed by cargo-mutants ~ */
         "java/lang/Long" => match name {
             "valueOf" if desc == "(J)Ljava/lang/Long;" => Some(CallModel::BoxStore(Ty::Long)),
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Long)),
             "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Long)),
             "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Long)),
             "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Long)),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),

*** result: Success
