*** crates/ajave-models/src/lib.rs:1163:27: replace match guard desc == "()I" with true in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace match guard desc == "()I" with true in box_model
@@ -1155,17 +1155,17 @@
             "logicalXor" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Xor)),
             "compare" => Some(CallModel::StaticBinOp(ajave_ir::BinOp::Sub)),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
         "java/lang/Integer" => match name {
             "valueOf" if desc == "(I)Ljava/lang/Integer;" => Some(CallModel::BoxStore(Ty::Int)),
-            "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
+            "intValue" if true /* ~ changed by cargo-mutants ~ */ => Some(CallModel::Unbox(Ty::Int)),
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
             "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" | "toHexString" | "toBinaryString" | "toOctalString"
             | "toUnsignedString" => Some(CallModel::MathCall(Some(Ty::Ref))),

*** result: Success
