*** crates/ajave-models/src/lib.rs:1169:13: delete match arm "compareTo" in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "compareTo" in box_model
@@ -1161,17 +1161,17 @@
         "java/lang/Integer" => match name {
             "valueOf" if desc == "(I)Ljava/lang/Integer;" => Some(CallModel::BoxStore(Ty::Int)),
             "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
             "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
+             /* ~ changed by cargo-mutants ~ */
             "toString" | "toHexString" | "toBinaryString" | "toOctalString"
             | "toUnsignedString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
         "java/lang/Long" => match name {
             "valueOf" if desc == "(J)Ljava/lang/Long;" => Some(CallModel::BoxStore(Ty::Long)),
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Long)),
             "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Long)),

*** result: Success
