*** crates/ajave-models/src/lib.rs:1183:13: delete match arm "toString" | "toHexString" | "toBinaryString" | "toOctalString" | "toUnsignedString" in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "toString" | "toHexString" | "toBinaryString" | "toOctalString" | "toUnsignedString" in box_model
@@ -1175,18 +1175,17 @@
             "valueOf" if desc == "(J)Ljava/lang/Long;" => Some(CallModel::BoxStore(Ty::Long)),
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Long)),
             "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Long)),
             "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Long)),
             "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Long)),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" | "toHexString" | "toBinaryString" | "toOctalString"
-            | "toUnsignedString" => Some(CallModel::MathCall(Some(Ty::Ref))),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         },
         "java/lang/Short" => match name {
             "valueOf" if desc == "(S)Ljava/lang/Short;" => Some(CallModel::BoxStore(Ty::Int)),
             "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
             "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
             "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),

*** result: Success
