*** crates/ajave-models/src/lib.rs:1190:32: replace == with != in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace == with != in box_model
@@ -1182,17 +1182,17 @@
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" | "toHexString" | "toBinaryString" | "toOctalString"
             | "toUnsignedString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
         "java/lang/Short" => match name {
             "valueOf" if desc == "(S)Ljava/lang/Short;" => Some(CallModel::BoxStore(Ty::Int)),
             "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
-            "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
+            "intValue" if desc != /* ~ changed by cargo-mutants ~ */ "()I" => Some(CallModel::Unbox(Ty::Int)),
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
             "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },

*** result: Success
