*** crates/ajave-models/src/lib.rs:1199:9: delete match arm "java/lang/Byte" in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/lang/Byte" in box_model
@@ -1191,28 +1191,17 @@
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
             "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
-        "java/lang/Byte" => match name {
-            "valueOf" if desc == "(B)Ljava/lang/Byte;" => Some(CallModel::BoxStore(Ty::Int)),
-            "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),
-            "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
-            "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
-            "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
-            "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            _ => None,
-        },
+         /* ~ changed by cargo-mutants ~ */
         "java/lang/Character" => match name {
             "valueOf" if desc == "(C)Ljava/lang/Character;" => Some(CallModel::BoxStore(Ty::Int)),
             "charValue" if desc == "()C" => Some(CallModel::Unbox(Ty::Int)),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
         "java/lang/Double" => match name {

*** result: Success
