*** crates/ajave-models/src/lib.rs:1202:27: replace match guard desc == "()I" with true in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace match guard desc == "()I" with true in box_model
@@ -1194,17 +1194,17 @@
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
         "java/lang/Byte" => match name {
             "valueOf" if desc == "(B)Ljava/lang/Byte;" => Some(CallModel::BoxStore(Ty::Int)),
             "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),
-            "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
+            "intValue" if true /* ~ changed by cargo-mutants ~ */ => Some(CallModel::Unbox(Ty::Int)),
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
             "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },

*** result: Success
