*** crates/ajave-models/src/lib.rs:1205:34: replace == with != in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace == with != in box_model
@@ -1197,17 +1197,17 @@
             _ => None,
         },
         "java/lang/Byte" => match name {
             "valueOf" if desc == "(B)Ljava/lang/Byte;" => Some(CallModel::BoxStore(Ty::Int)),
             "byteValue" if desc == "()B" => Some(CallModel::Unbox(Ty::Int)),
             "intValue" if desc == "()I" => Some(CallModel::Unbox(Ty::Int)),
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
             "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
-            "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
+            "floatValue" if desc != /* ~ changed by cargo-mutants ~ */ "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
         "java/lang/Character" => match name {
             "valueOf" if desc == "(C)Ljava/lang/Character;" => Some(CallModel::BoxStore(Ty::Int)),
             "charValue" if desc == "()C" => Some(CallModel::Unbox(Ty::Int)),

*** result: Success
