*** crates/ajave-models/src/lib.rs:1211:9: delete match arm "java/lang/Character" in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/lang/Character" in box_model
@@ -1203,23 +1203,17 @@
             "longValue" if desc == "()J" => Some(CallModel::Unbox(Ty::Int)),
             "shortValue" if desc == "()S" => Some(CallModel::Unbox(Ty::Int)),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
-        "java/lang/Character" => match name {
-            "valueOf" if desc == "(C)Ljava/lang/Character;" => Some(CallModel::BoxStore(Ty::Int)),
-            "charValue" if desc == "()C" => Some(CallModel::Unbox(Ty::Int)),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            _ => None,
-        },
+         /* ~ changed by cargo-mutants ~ */
         "java/lang/Double" => match name {
             "valueOf" if desc == "(D)Ljava/lang/Double;" => Some(CallModel::BoxStore(Ty::Double)),
             "doubleValue" if desc == "()D" => Some(CallModel::Unbox(Ty::Double)),
             "intValue" if desc == "()I" => Some(CallModel::MathCall(Some(Ty::Int))),
             "longValue" if desc == "()J" => Some(CallModel::MathCall(Some(Ty::Long))),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),

*** result: Success
