*** crates/ajave-models/src/lib.rs:1213:28: replace match guard desc == "()C" with false in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace match guard desc == "()C" with false in box_model
@@ -1205,17 +1205,17 @@
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
         "java/lang/Character" => match name {
             "valueOf" if desc == "(C)Ljava/lang/Character;" => Some(CallModel::BoxStore(Ty::Int)),
-            "charValue" if desc == "()C" => Some(CallModel::Unbox(Ty::Int)),
+            "charValue" if false /* ~ changed by cargo-mutants ~ */ => Some(CallModel::Unbox(Ty::Int)),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
         "java/lang/Double" => match name {
             "valueOf" if desc == "(D)Ljava/lang/Double;" => Some(CallModel::BoxStore(Ty::Double)),
             "doubleValue" if desc == "()D" => Some(CallModel::Unbox(Ty::Double)),
             "intValue" if desc == "()I" => Some(CallModel::MathCall(Some(Ty::Int))),

*** result: Success
