*** crates/ajave-models/src/lib.rs:1218:9: delete match arm "java/lang/Double" in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/lang/Double" in box_model
@@ -1210,30 +1210,17 @@
         },
         "java/lang/Character" => match name {
             "valueOf" if desc == "(C)Ljava/lang/Character;" => Some(CallModel::BoxStore(Ty::Int)),
             "charValue" if desc == "()C" => Some(CallModel::Unbox(Ty::Int)),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
-        "java/lang/Double" => match name {
-            "valueOf" if desc == "(D)Ljava/lang/Double;" => Some(CallModel::BoxStore(Ty::Double)),
-            "doubleValue" if desc == "()D" => Some(CallModel::Unbox(Ty::Double)),
-            "intValue" if desc == "()I" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "longValue" if desc == "()J" => Some(CallModel::MathCall(Some(Ty::Long))),
-            "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
-            "isNaN" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "isInfinite" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "byteValue" if desc == "()B" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "shortValue" if desc == "()S" => Some(CallModel::MathCall(Some(Ty::Int))),
-            _ => None,
-        },
+         /* ~ changed by cargo-mutants ~ */
         "java/lang/Float" => match name {
             "valueOf" if desc == "(F)Ljava/lang/Float;" => Some(CallModel::BoxStore(Ty::Int)),
             "floatValue" if desc == "()F" => Some(CallModel::Unbox(Ty::Int)),
             "intValue" if desc == "()I" => Some(CallModel::MathCall(Some(Ty::Int))),
             "longValue" if desc == "()J" => Some(CallModel::MathCall(Some(Ty::Long))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),

*** result: Success
