*** crates/ajave-models/src/lib.rs:1220:30: replace match guard desc == "()D" with false in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace match guard desc == "()D" with false in box_model
@@ -1212,17 +1212,17 @@
             "valueOf" if desc == "(C)Ljava/lang/Character;" => Some(CallModel::BoxStore(Ty::Int)),
             "charValue" if desc == "()C" => Some(CallModel::Unbox(Ty::Int)),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
         "java/lang/Double" => match name {
             "valueOf" if desc == "(D)Ljava/lang/Double;" => Some(CallModel::BoxStore(Ty::Double)),
-            "doubleValue" if desc == "()D" => Some(CallModel::Unbox(Ty::Double)),
+            "doubleValue" if false /* ~ changed by cargo-mutants ~ */ => Some(CallModel::Unbox(Ty::Double)),
             "intValue" if desc == "()I" => Some(CallModel::MathCall(Some(Ty::Int))),
             "longValue" if desc == "()J" => Some(CallModel::MathCall(Some(Ty::Long))),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             "isNaN" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
             "isInfinite" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
             "byteValue" if desc == "()B" => Some(CallModel::MathCall(Some(Ty::Int))),

*** result: Success
