*** crates/ajave-models/src/lib.rs:1221:27: replace match guard desc == "()I" with true in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace match guard desc == "()I" with true in box_model
@@ -1213,17 +1213,17 @@
             "charValue" if desc == "()C" => Some(CallModel::Unbox(Ty::Int)),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             _ => None,
         },
         "java/lang/Double" => match name {
             "valueOf" if desc == "(D)Ljava/lang/Double;" => Some(CallModel::BoxStore(Ty::Double)),
             "doubleValue" if desc == "()D" => Some(CallModel::Unbox(Ty::Double)),
-            "intValue" if desc == "()I" => Some(CallModel::MathCall(Some(Ty::Int))),
+            "intValue" if true /* ~ changed by cargo-mutants ~ */ => Some(CallModel::MathCall(Some(Ty::Int))),
             "longValue" if desc == "()J" => Some(CallModel::MathCall(Some(Ty::Long))),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             "isNaN" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
             "isInfinite" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
             "byteValue" if desc == "()B" => Some(CallModel::MathCall(Some(Ty::Int))),
             "shortValue" if desc == "()S" => Some(CallModel::MathCall(Some(Ty::Int))),

*** result: Success
