*** crates/ajave-models/src/lib.rs:1224:13: delete match arm "compareTo" in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "compareTo" in box_model
@@ -1216,17 +1216,17 @@
             _ => None,
         },
         "java/lang/Double" => match name {
             "valueOf" if desc == "(D)Ljava/lang/Double;" => Some(CallModel::BoxStore(Ty::Double)),
             "doubleValue" if desc == "()D" => Some(CallModel::Unbox(Ty::Double)),
             "intValue" if desc == "()I" => Some(CallModel::MathCall(Some(Ty::Int))),
             "longValue" if desc == "()J" => Some(CallModel::MathCall(Some(Ty::Long))),
             "floatValue" if desc == "()F" => Some(CallModel::MathCall(Some(Ty::Int))),
-            "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
+             /* ~ changed by cargo-mutants ~ */
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             "isNaN" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
             "isInfinite" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
             "byteValue" if desc == "()B" => Some(CallModel::MathCall(Some(Ty::Int))),
             "shortValue" if desc == "()S" => Some(CallModel::MathCall(Some(Ty::Int))),
             _ => None,
         },
         "java/lang/Float" => match name {

*** result: Success
