*** crates/ajave-models/src/lib.rs:1234:34: replace == with != in box_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace == with != in box_model
@@ -1226,17 +1226,17 @@
             "isNaN" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
             "isInfinite" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
             "byteValue" if desc == "()B" => Some(CallModel::MathCall(Some(Ty::Int))),
             "shortValue" if desc == "()S" => Some(CallModel::MathCall(Some(Ty::Int))),
             _ => None,
         },
         "java/lang/Float" => match name {
             "valueOf" if desc == "(F)Ljava/lang/Float;" => Some(CallModel::BoxStore(Ty::Int)),
-            "floatValue" if desc == "()F" => Some(CallModel::Unbox(Ty::Int)),
+            "floatValue" if desc != /* ~ changed by cargo-mutants ~ */ "()F" => Some(CallModel::Unbox(Ty::Int)),
             "intValue" if desc == "()I" => Some(CallModel::MathCall(Some(Ty::Int))),
             "longValue" if desc == "()J" => Some(CallModel::MathCall(Some(Ty::Long))),
             "doubleValue" if desc == "()D" => Some(CallModel::MathCall(Some(Ty::Double))),
             "compareTo" => Some(CallModel::MathCall(Some(Ty::Int))),
             "toString" => Some(CallModel::MathCall(Some(Ty::Ref))),
             "isNaN" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
             "isInfinite" if desc == "()Z" => Some(CallModel::MathCall(Some(Ty::Int))),
             "byteValue" if desc == "()B" => Some(CallModel::MathCall(Some(Ty::Int))),

*** result: Success
