*** crates/ajave-models/src/lib.rs:124:9: replace Effect::rank -> u8 with 0

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace Effect::rank -> u8 with 0
@@ -116,21 +116,17 @@
     /// May write anything; the conservative fallback.
     Unknown,
 }
 
 impl Effect {
     /// Position in the lattice `Pure < Receiver < Unknown`, where higher is
     /// more conservative: assuming a call writes more can only lose precision.
     pub fn rank(self) -> u8 {
-        match self {
-            Effect::Pure => 0,
-            Effect::Receiver => 1,
-            Effect::Unknown => 2,
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Everything we claim about an external method, in one place.
 ///
 /// Previously this knowledge was spread across `could_throw_runtime_exception`,
 /// `pure_owner_member_may_throw`, `str_call_can_throw`, `PURE_OWNERS` and the
 /// field-abstraction clobber sets — five representations that drifted apart and

---- contract_order_tests::a_wider_effect_is_more_conservative stdout ----

thread 'contract_order_tests::a_wider_effect_is_more_conservative' (48795488) panicked at crates/ajave-models/src/lib.rs:1955:9:
assertion failed: !pure.at_least_as_conservative_as(&recv)

failures:
    contract_order_tests::a_wider_effect_is_more_conservative

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
