*** crates/ajave-models/src/lib.rs:1253:5: replace is_math_call -> bool with false

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace is_math_call -> bool with false
@@ -1245,184 +1245,17 @@
         },
         _ => None,
     }
 }
 
 /// Check whether a Math/Integer/Long static method should be kept as a Call
 /// so the SMT engine can model it precisely instead of havocing.
 fn is_math_call(owner: &str, name: &str) -> bool {
-    match owner {
-        "java/lang/Math" | "java/lang/StrictMath" => matches!(
-            name,
-            "abs"
-                | "min"
-                | "max"
-                | "addExact"
-                | "subtractExact"
-                | "multiplyExact"
-                | "negateExact"
-                | "floorDiv"
-                | "floorMod"
-                | "sin"
-                | "cos"
-                | "tan"
-                | "asin"
-                | "acos"
-                | "atan"
-                | "atan2"
-                | "exp"
-                | "log"
-                | "log10"
-                | "pow"
-                | "sqrt"
-                | "round"
-                | "ceil"
-                | "floor"
-                | "toRadians"
-                | "toDegrees"
-                | "sinh"
-                | "cosh"
-                | "tanh"
-                | "getExponent"
-        ),
-        "java/lang/Integer" => matches!(
-            name,
-            "parseInt"
-                | "max"
-                | "min"
-                | "sum"
-                | "reverseBytes"
-                | "highestOneBit"
-                | "lowestOneBit"
-                | "signum"
-                | "toUnsignedLong"
-                | "divideUnsigned"
-                | "remainderUnsigned"
-                | "compareUnsigned"
-                | "hashCode"
-                | "compare"
-                | "rotateLeft"
-                | "rotateRight"
-                | "bitCount"
-                | "numberOfLeadingZeros"
-                | "numberOfTrailingZeros"
-                | "reverse"
-        ),
-        "java/lang/Long" => matches!(
-            name,
-            "parseLong"
-                | "max"
-                | "min"
-                | "sum"
-                | "signum"
-                | "divideUnsigned"
-                | "remainderUnsigned"
-                | "compareUnsigned"
-                | "hashCode"
-                | "compare"
-                | "reverseBytes"
-                | "highestOneBit"
-                | "lowestOneBit"
-                | "rotateLeft"
-                | "rotateRight"
-                | "bitCount"
-                | "numberOfLeadingZeros"
-                | "numberOfTrailingZeros"
-                | "reverse"
-        ),
-        "java/lang/Character" => matches!(
-            name,
-            "isDigit"
-                | "isLetter"
-                | "isLetterOrDigit"
-                | "isUpperCase"
-                | "isLowerCase"
-                | "isWhitespace"
-                | "isSpaceChar"
-                | "isAlphabetic"
-                | "isBmpCodePoint"
-                | "isSupplementaryCodePoint"
-                | "isValidCodePoint"
-                | "toUpperCase"
-                | "toLowerCase"
-                | "toTitleCase"
-                | "digit"
-                | "forDigit"
-                | "charCount"
-                | "toCodePoint"
-                | "compare"
-                | "compareTo"
-                | "hashCode"
-                | "reverseBytes"
-                | "isISOControl"
-                | "isSpace"
-                | "isJavaIdentifierStart"
-                | "isJavaIdentifierPart"
-                | "isJavaLetter"
-                | "isJavaLetterOrDigit"
-                | "getType"
-                | "isDefined"
-                | "isMirrored"
-                | "isTitleCase"
-                | "isUnicodeIdentifierPart"
-                | "isUnicodeIdentifierStart"
-                | "isIdentifierIgnorable"
-                | "getDirectionality"
-                | "getNumericValue"
-                | "isIdeographic"
-        ),
-        "java/lang/Short" => matches!(
-            name,
-            "parseShort"
-                | "compare"
-                | "compareTo"
-                | "hashCode"
-                | "reverseBytes"
-                | "toUnsignedInt"
-                | "toUnsignedLong"
-        ),
-        "java/lang/Byte" => matches!(
-            name,
-            "parseByte" | "compare" | "compareTo" | "hashCode" | "toUnsignedInt" | "toUnsignedLong"
-        ),
-        "java/lang/Boolean" => matches!(
-            name,
-            "logicalAnd" | "logicalOr" | "logicalXor" | "compare" | "hashCode"
-        ),
-        "java/lang/Float" => matches!(
-            name,
-            "floatToRawIntBits"
-                | "floatToIntBits"
-                | "intBitsToFloat"
-                | "isNaN"
-                | "isInfinite"
-                | "isFinite"
-                | "compare"
-                | "max"
-                | "min"
-                | "sum"
-                | "hashCode"
-        ),
-        "java/lang/Double" => matches!(
-            name,
-            "doubleToRawLongBits"
-                | "doubleToLongBits"
-                | "longBitsToDouble"
-                | "isNaN"
-                | "isInfinite"
-                | "isFinite"
-                | "compare"
-                | "max"
-                | "min"
-                | "sum"
-                | "hashCode"
-        ),
-        _ => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Owners that are collection types (List, Set, Map, Queue, Deque + impls).
 fn is_collection_owner(owner: &str) -> bool {
     matches!(
         owner,
         "java/util/List"
             | "java/util/ArrayList"

*** result: Success
