*** crates/ajave-models/src/lib.rs:1332:9: delete match arm "java/lang/Character" in is_math_call

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/lang/Character" in is_math_call
@@ -1324,57 +1324,17 @@
                 | "lowestOneBit"
                 | "rotateLeft"
                 | "rotateRight"
                 | "bitCount"
                 | "numberOfLeadingZeros"
                 | "numberOfTrailingZeros"
                 | "reverse"
         ),
-        "java/lang/Character" => matches!(
-            name,
-            "isDigit"
-                | "isLetter"
-                | "isLetterOrDigit"
-                | "isUpperCase"
-                | "isLowerCase"
-                | "isWhitespace"
-                | "isSpaceChar"
-                | "isAlphabetic"
-                | "isBmpCodePoint"
-                | "isSupplementaryCodePoint"
-                | "isValidCodePoint"
-                | "toUpperCase"
-                | "toLowerCase"
-                | "toTitleCase"
-                | "digit"
-                | "forDigit"
-                | "charCount"
-                | "toCodePoint"
-                | "compare"
-                | "compareTo"
-                | "hashCode"
-                | "reverseBytes"
-                | "isISOControl"
-                | "isSpace"
-                | "isJavaIdentifierStart"
-                | "isJavaIdentifierPart"
-                | "isJavaLetter"
-                | "isJavaLetterOrDigit"
-                | "getType"
-                | "isDefined"
-                | "isMirrored"
-                | "isTitleCase"
-                | "isUnicodeIdentifierPart"
-                | "isUnicodeIdentifierStart"
-                | "isIdentifierIgnorable"
-                | "getDirectionality"
-                | "getNumericValue"
-                | "isIdeographic"
-        ),
+         /* ~ changed by cargo-mutants ~ */
         "java/lang/Short" => matches!(
             name,
             "parseShort"
                 | "compare"
                 | "compareTo"
                 | "hashCode"
                 | "reverseBytes"
                 | "toUnsignedInt"

*** result: Success
