*** crates/ajave-models/src/lib.rs:1405:9: delete match arm "java/lang/Double" in is_math_call

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "java/lang/Double" in is_math_call
@@ -1397,30 +1397,17 @@
                 | "isInfinite"
                 | "isFinite"
                 | "compare"
                 | "max"
                 | "min"
                 | "sum"
                 | "hashCode"
         ),
-        "java/lang/Double" => matches!(
-            name,
-            "doubleToRawLongBits"
-                | "doubleToLongBits"
-                | "longBitsToDouble"
-                | "isNaN"
-                | "isInfinite"
-                | "isFinite"
-                | "compare"
-                | "max"
-                | "min"
-                | "sum"
-                | "hashCode"
-        ),
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 /// Owners that are collection types (List, Set, Map, Queue, Deque + impls).
 fn is_collection_owner(owner: &str) -> bool {
     matches!(
         owner,

*** result: Success
