*** crates/ajave-models/src/lib.rs:1447:5: replace is_map_owner -> bool with true

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace is_map_owner -> bool with true
@@ -1439,25 +1439,17 @@
             | "java/util/AbstractSet"
             | "java/util/Queue"
             | "java/util/Deque"
             | "java/util/ArrayDeque"
     )
 }
 
 fn is_map_owner(owner: &str) -> bool {
-    matches!(
-        owner,
-        "java/util/Map"
-            | "java/util/HashMap"
-            | "java/util/TreeMap"
-            | "java/util/LinkedHashMap"
-            | "java/util/AbstractMap"
-            | "java/util/Hashtable"
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_iterator_owner(owner: &str) -> bool {
     matches!(owner, "java/util/Iterator" | "java/util/ListIterator")
 }
 
 fn is_map_entry_owner(owner: &str) -> bool {
     matches!(

*** result: Success
