*** crates/ajave-models/src/lib.rs:1487:13: delete match arm "getValue" | "getKey" in collection_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "getValue" | "getKey" in collection_model
@@ -1479,17 +1479,17 @@
             // hasNext → unconstrained boolean (Pure/Havoc)
             _ => None,
         };
     }
 
     // Map.Entry methods — getValue/getKey read from the same $coll_last
     if is_map_entry_owner(owner) {
         return match name {
-            "getValue" | "getKey" => Some(CallModel::CollectionLoad(ret_ty(desc))),
+             /* ~ changed by cargo-mutants ~ */
             "setValue" => Some(CallModel::CollectionStore(0)),
             _ => None,
         };
     }
 
     // Map methods
     if is_map_owner(owner) {
         return match name {

*** result: Success
