*** crates/ajave-models/src/lib.rs:1498:13: delete match arm "values" | "keySet" | "entrySet" in collection_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "values" | "keySet" | "entrySet" in collection_model
@@ -1490,17 +1490,17 @@
         };
     }
 
     // Map methods
     if is_map_owner(owner) {
         return match name {
             "put" | "putIfAbsent" => Some(CallModel::CollectionStore(1)), // put(key, val) → store arg[1]
             "get" | "remove" | "getOrDefault" => Some(CallModel::CollectionLoad(ret_ty(desc))),
-            "values" | "keySet" | "entrySet" => Some(CallModel::CollectionIterator),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         };
     }
 
     if !is_collection_owner(owner) {
         return None;
     }

*** result: Success
