*** crates/ajave-models/src/lib.rs:1509:9: delete match arm "add" | "offer" in collection_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "add" | "offer" in collection_model
@@ -1501,21 +1501,17 @@
     }
 
     if !is_collection_owner(owner) {
         return None;
     }
 
     // Collection/List/Set/Queue/Deque store methods
     match name {
-        "add" | "offer" => {
-            // add(Object) → arg 0; add(int, Object) → arg 1
-            let elem_idx = if desc.starts_with("(I") { 1 } else { 0 };
-            Some(CallModel::CollectionStore(elem_idx))
-        }
+         /* ~ changed by cargo-mutants ~ */
         "addLast" | "addFirst" | "push" | "offerFirst" | "offerLast" | "addElement" => {
             Some(CallModel::CollectionStore(0))
         }
         "set" => Some(CallModel::CollectionStore(1)), // set(int, Object) → arg 1
 
         // Collection/List/Queue/Deque load methods
         "get" | "remove" | "getLast" | "getFirst" | "peek" | "peekFirst" | "peekLast" | "poll"
         | "pollFirst" | "pollLast" | "pop" | "removeFirst" | "removeLast" | "element"

*** result: Success
