*** crates/ajave-models/src/lib.rs:1517:9: delete match arm "set" in collection_model

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "set" in collection_model
@@ -1509,17 +1509,17 @@
         "add" | "offer" => {
             // add(Object) → arg 0; add(int, Object) → arg 1
             let elem_idx = if desc.starts_with("(I") { 1 } else { 0 };
             Some(CallModel::CollectionStore(elem_idx))
         }
         "addLast" | "addFirst" | "push" | "offerFirst" | "offerLast" | "addElement" => {
             Some(CallModel::CollectionStore(0))
         }
-        "set" => Some(CallModel::CollectionStore(1)), // set(int, Object) → arg 1
+         /* ~ changed by cargo-mutants ~ */ // set(int, Object) → arg 1
 
         // Collection/List/Queue/Deque load methods
         "get" | "remove" | "getLast" | "getFirst" | "peek" | "peekFirst" | "peekLast" | "poll"
         | "pollFirst" | "pollLast" | "pop" | "removeFirst" | "removeLast" | "element"
         | "elementAt" | "firstElement" | "lastElement" => {
             Some(CallModel::CollectionLoad(ret_ty(desc)))
         }

*** result: Success
