*** crates/ajave-models/src/lib.rs:179:9: replace Contract::is_total -> bool with true

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace Contract::is_total -> bool with true
@@ -171,17 +171,17 @@
     const TOTAL_MUT: Contract = Contract {
         requires: &[],
         effect: Effect::Receiver,
         may_return_null: true,
     };
 
     /// `true` when no input can make this call raise a `RuntimeException`.
     pub fn is_total(&self) -> bool {
-        self.requires.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Is this contract at least as conservative as `other`?
     ///
     /// # Why an order exists at all
     ///
     /// Contracts are not symmetric under error. One that is **too strong** --
     /// claiming preconditions the real method does not have, or a broader

---- smt_bmc::explore::jdk_allowlist_tests::throwing_signatures_are_not_allowlisted stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::throwing_signatures_are_not_allowlisted' (48799999) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:1942:13:
java/util/ArrayList.get(I)Ljava/lang/Object; throws a RuntimeException but is allowlisted as total — that is a reachable wrong TRUE

failures:
    smt_bmc::explore::jdk_allowlist_tests::throwing_signatures_are_not_allowlisted

test result: FAILED. 54 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
