*** crates/ajave-models/src/lib.rs:179:9: replace Contract::is_total -> bool with false

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace Contract::is_total -> bool with false
@@ -171,17 +171,17 @@
     const TOTAL_MUT: Contract = Contract {
         requires: &[],
         effect: Effect::Receiver,
         may_return_null: true,
     };
 
     /// `true` when no input can make this call raise a `RuntimeException`.
     pub fn is_total(&self) -> bool {
-        self.requires.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Is this contract at least as conservative as `other`?
     ///
     /// # Why an order exists at all
     ///
     /// Contracts are not symmetric under error. One that is **too strong** --
     /// claiming preconditions the real method does not have, or a broader

---- smt_bmc::explore::jdk_allowlist_tests::collections_factories_are_total_but_the_class_is_not stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::collections_factories_are_total_but_the_class_is_not' (48802267) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:1995:9:
assertion failed: is_total_jdk_method("java/util/Collections", "emptyList",
    "()Ljava/util/List;")

---- smt_bmc::explore::jdk_allowlist_tests::enumeration_has_more_elements_is_total_but_next_element_is_not stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::enumeration_has_more_elements_is_total_but_next_element_is_not' (48802272) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:1981:9:
assertion failed: is_total_jdk_method("java/util/Enumeration", "hasMoreElements", "()Z")

---- smt_bmc::explore::jdk_allowlist_tests::total_signatures_are_allowlisted stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::total_signatures_are_allowlisted' (48802275) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:1953:13:
java/lang/Object.hashCode()I is total but is not allowlisted — costs precision

failures:
    smt_bmc::explore::jdk_allowlist_tests::collections_factories_are_total_but_the_class_is_not
    smt_bmc::explore::jdk_allowlist_tests::enumeration_has_more_elements_is_total_but_next_element_is_not
    smt_bmc::explore::jdk_allowlist_tests::total_signatures_are_allowlisted
    smt_bmc::explore::jdk_allowlist_tests::verifier_match_is_exact

test result: FAILED. 51 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
