*** crates/ajave-models/src/lib.rs:201:9: replace Contract::at_least_as_conservative_as -> bool with true

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace Contract::at_least_as_conservative_as -> bool with true
@@ -193,21 +193,17 @@
     /// So only movement *up* this order is safe, and the two kinds of mistake
     /// look identical without it. Issue #48 found 22 wrongly-allowlisted
     /// methods that accumulated precisely because nothing could tell them
     /// apart.
     ///
     /// More preconditions is more conservative; a wider effect is more
     /// conservative.
     pub fn at_least_as_conservative_as(&self, other: &Contract) -> bool {
-        let covers = other
-            .requires
-            .iter()
-            .all(|p| self.requires.iter().any(|q| q == p));
-        covers && self.effect.rank() >= other.effect.rank()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The most conservative contract: assume it can throw for reasons we
     /// cannot state, and that it writes anything.
     pub const OPAQUE: Contract = Contract {
         requires: &[Precondition::Unexpressible],
         effect: Effect::Unknown,
         may_return_null: true,

---- contract_order_tests::a_wider_effect_is_more_conservative stdout ----

thread 'contract_order_tests::a_wider_effect_is_more_conservative' (48804694) panicked at crates/ajave-models/src/lib.rs:1955:9:
assertion failed: !pure.at_least_as_conservative_as(&recv)

---- contract_order_tests::more_preconditions_is_more_conservative stdout ----

thread 'contract_order_tests::more_preconditions_is_more_conservative' (48804695) panicked at crates/ajave-models/src/lib.rs:1933:9:
assertion failed: !weak.at_least_as_conservative_as(&strong)

failures:
    contract_order_tests::a_wider_effect_is_more_conservative
    contract_order_tests::more_preconditions_is_more_conservative

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
