*** crates/ajave-models/src/lib.rs:204:53: replace == with != in Contract::at_least_as_conservative_as

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace == with != in Contract::at_least_as_conservative_as
@@ -196,17 +196,17 @@
     /// apart.
     ///
     /// More preconditions is more conservative; a wider effect is more
     /// conservative.
     pub fn at_least_as_conservative_as(&self, other: &Contract) -> bool {
         let covers = other
             .requires
             .iter()
-            .all(|p| self.requires.iter().any(|q| q == p));
+            .all(|p| self.requires.iter().any(|q| q != /* ~ changed by cargo-mutants ~ */ p));
         covers && self.effect.rank() >= other.effect.rank()
     }
 
     /// The most conservative contract: assume it can throw for reasons we
     /// cannot state, and that it writes anything.
     pub const OPAQUE: Contract = Contract {
         requires: &[Precondition::Unexpressible],
         effect: Effect::Unknown,

*** result: Success
