*** crates/ajave-models/src/lib.rs:205:16: replace && with || in Contract::at_least_as_conservative_as

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace && with || in Contract::at_least_as_conservative_as
@@ -197,17 +197,17 @@
     ///
     /// More preconditions is more conservative; a wider effect is more
     /// conservative.
     pub fn at_least_as_conservative_as(&self, other: &Contract) -> bool {
         let covers = other
             .requires
             .iter()
             .all(|p| self.requires.iter().any(|q| q == p));
-        covers && self.effect.rank() >= other.effect.rank()
+        covers || /* ~ changed by cargo-mutants ~ */ self.effect.rank() >= other.effect.rank()
     }
 
     /// The most conservative contract: assume it can throw for reasons we
     /// cannot state, and that it writes anything.
     pub const OPAQUE: Contract = Contract {
         requires: &[Precondition::Unexpressible],
         effect: Effect::Unknown,
         may_return_null: true,

---- contract_order_tests::a_wider_effect_is_more_conservative stdout ----

thread 'contract_order_tests::a_wider_effect_is_more_conservative' (48811795) panicked at crates/ajave-models/src/lib.rs:1959:9:
assertion failed: !pure.at_least_as_conservative_as(&recv)

---- contract_order_tests::more_preconditions_is_more_conservative stdout ----

thread 'contract_order_tests::more_preconditions_is_more_conservative' (48811796) panicked at crates/ajave-models/src/lib.rs:1937:9:
assertion failed: !weak.at_least_as_conservative_as(&strong)

failures:
    contract_order_tests::a_wider_effect_is_more_conservative
    contract_order_tests::more_preconditions_is_more_conservative

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
