*** crates/ajave-models/src/lib.rs:205:38: replace >= with < in Contract::at_least_as_conservative_as

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace >= with < in Contract::at_least_as_conservative_as
@@ -197,17 +197,17 @@
     ///
     /// More preconditions is more conservative; a wider effect is more
     /// conservative.
     pub fn at_least_as_conservative_as(&self, other: &Contract) -> bool {
         let covers = other
             .requires
             .iter()
             .all(|p| self.requires.iter().any(|q| q == p));
-        covers && self.effect.rank() >= other.effect.rank()
+        covers && self.effect.rank() < /* ~ changed by cargo-mutants ~ */ other.effect.rank()
     }
 
     /// The most conservative contract: assume it can throw for reasons we
     /// cannot state, and that it writes anything.
     pub const OPAQUE: Contract = Contract {
         requires: &[Precondition::Unexpressible],
         effect: Effect::Unknown,
         may_return_null: true,

---- contract_order_tests::a_wider_effect_is_more_conservative stdout ----

thread 'contract_order_tests::a_wider_effect_is_more_conservative' (48814149) panicked at crates/ajave-models/src/lib.rs:1957:9:
assertion failed: recv.at_least_as_conservative_as(&pure)

---- contract_order_tests::the_order_is_reflexive_and_transitive_where_it_should_be stdout ----

thread 'contract_order_tests::the_order_is_reflexive_and_transitive_where_it_should_be' (48814152) panicked at crates/ajave-models/src/lib.rs:1995:9:
assertion failed: a.at_least_as_conservative_as(&a)

---- contract_order_tests::opaque_is_the_top_of_the_order stdout ----

thread 'contract_order_tests::opaque_is_the_top_of_the_order' (48814151) panicked at crates/ajave-models/src/lib.rs:1974:17:
java/lang/String.length is not below OPAQUE

failures:
    contract_order_tests::a_wider_effect_is_more_conservative
    contract_order_tests::more_preconditions_is_more_conservative
    contract_order_tests::opaque_is_the_top_of_the_order
    contract_order_tests::the_order_is_reflexive_and_transitive_where_it_should_be

test result: FAILED. 1 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
