*** crates/ajave-models/src/lib.rs:268:5: replace perturbed -> bool with true

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace perturbed -> bool with true
@@ -260,24 +260,17 @@
 /// different verdict.
 ///
 /// This is what makes the order in `at_least_as_conservative_as` checkable
 /// rather than merely stated: `tools/contract_monotonicity.py` perturbs each
 /// contract in turn and looks for a flip. A flip means some consumer is not
 /// monotone, which is the defect class behind #48 -- and one that no amount of
 /// reading the table can reveal.
 fn perturbed(class: &str, name: &str) -> bool {
-    static SPEC: std::sync::OnceLock<Option<(String, String)>> = std::sync::OnceLock::new();
-    let spec = SPEC.get_or_init(|| {
-        std::env::var("AJAVE_PERTURB_CONTRACT").ok().and_then(|v| {
-            let (c, n) = v.split_once(':')?;
-            Some((c.to_string(), n.to_string()))
-        })
-    });
-    matches!(spec, Some((c, n)) if c == class && n == name)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// The contract for a method, always.
 ///
 /// # Why a total function, and why `OPAQUE` is the default
 ///
 /// `contract_of` returns `Option`, and that `None` conflates two different
 /// things: "this method is specified to throw for some inputs" and "we have

---- smt_bmc::explore::jdk_allowlist_tests::collections_factories_are_total_but_the_class_is_not stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::collections_factories_are_total_but_the_class_is_not' (48821176) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:1995:9:
assertion failed: is_total_jdk_method("java/util/Collections", "emptyList",
    "()Ljava/util/List;")

---- smt_bmc::explore::jdk_allowlist_tests::total_signatures_are_allowlisted stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::total_signatures_are_allowlisted' (48821179) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:1953:13:
java/lang/Object.hashCode()I is total but is not allowlisted — costs precision

---- smt_bmc::explore::jdk_allowlist_tests::enumeration_has_more_elements_is_total_but_next_element_is_not stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::enumeration_has_more_elements_is_total_but_next_element_is_not' (48821177) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:1981:9:
assertion failed: is_total_jdk_method("java/util/Enumeration", "hasMoreElements", "()Z")

failures:
    smt_bmc::explore::jdk_allowlist_tests::collections_factories_are_total_but_the_class_is_not
    smt_bmc::explore::jdk_allowlist_tests::enumeration_has_more_elements_is_total_but_next_element_is_not
    smt_bmc::explore::jdk_allowlist_tests::total_signatures_are_allowlisted
    smt_bmc::explore::jdk_allowlist_tests::verifier_match_is_exact

test result: FAILED. 51 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
