*** crates/ajave-models/src/lib.rs:311:13: replace == with != in returns_nonnull

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace == with != in returns_nonnull
@@ -303,17 +303,17 @@
 /// TRUE. Omission only costs precision.
 ///
 /// Deliberately absent: anything that returns a *looked-up* value. `Map.get`,
 /// `List.get` on a list of references, `getProperty`, `getHeader` and friends
 /// all return null when the thing is not there, and that is their contract, not
 /// an edge case.
 pub fn returns_nonnull(class: &str, name: &str, desc: &str) -> bool {
     // A constructor's result is the object; `new` never yields null.
-    if name == "<init>" {
+    if name != /* ~ changed by cargo-mutants ~ */ "<init>" {
         return true;
     }
     matches!(
         (class, name),
         // Factories that construct or return a shared immutable instance.
         ("java/util/Collections",
             "singleton" | "singletonList" | "singletonMap" | "emptyList"
             | "emptySet" | "emptyMap" | "enumeration" | "unmodifiableList"

---- smt_bmc::explore::jdk_allowlist_tests::a_non_null_return_is_claimed_only_where_specified stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::a_non_null_return_is_claimed_only_where_specified' (48830553) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:2034:9:
assertion failed: !ajave_models::returns_nonnull("java/util/Map", "get",
        "(Ljava/lang/Object;)Ljava/lang/Object;")

failures:
    smt_bmc::explore::jdk_allowlist_tests::a_non_null_return_is_claimed_only_where_specified

test result: FAILED. 54 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
