*** crates/ajave-models/src/lib.rs:311:5: replace returns_nonnull -> bool with true

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace returns_nonnull -> bool with true
@@ -303,43 +303,17 @@
 /// TRUE. Omission only costs precision.
 ///
 /// Deliberately absent: anything that returns a *looked-up* value. `Map.get`,
 /// `List.get` on a list of references, `getProperty`, `getHeader` and friends
 /// all return null when the thing is not there, and that is their contract, not
 /// an edge case.
 pub fn returns_nonnull(class: &str, name: &str, desc: &str) -> bool {
     // A constructor's result is the object; `new` never yields null.
-    if name == "<init>" {
-        return true;
-    }
-    matches!(
-        (class, name),
-        // Factories that construct or return a shared immutable instance.
-        ("java/util/Collections",
-            "singleton" | "singletonList" | "singletonMap" | "emptyList"
-            | "emptySet" | "emptyMap" | "enumeration" | "unmodifiableList"
-            | "unmodifiableSet" | "unmodifiableMap" | "unmodifiableCollection"
-            | "synchronizedList" | "synchronizedSet" | "synchronizedMap"
-            | "nCopies" | "list")
-        // `toString` on these is specified to produce a String.
-        | ("java/lang/StringBuilder" | "java/lang/StringBuffer", "toString" | "append")
-        | ("java/lang/String",
-            "toString" | "trim" | "toUpperCase" | "toLowerCase" | "concat"
-            | "substring" | "replace" | "intern" | "toCharArray" | "valueOf"
-            | "join" | "strip" | "repeat")
-        | ("java/lang/Object", "toString" | "getClass")
-        | ("java/lang/Integer" | "java/lang/Long" | "java/lang/Short"
-            | "java/lang/Byte" | "java/lang/Float" | "java/lang/Double"
-            | "java/lang/Boolean" | "java/lang/Character",
-            "valueOf" | "toString" | "toBinaryString" | "toHexString"
-            | "toOctalString")
-        | ("java/util/Objects", "requireNonNull" | "toString")
-        | ("java/util/Arrays", "asList" | "copyOf" | "copyOfRange" | "toString")
-    ) && !desc.ends_with(")V")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn contract_for(class: &str, name: &str, desc: &str) -> Contract {
     contract_of(class, name, desc).unwrap_or(Contract::OPAQUE)
 }
 
 pub fn contract_of(class: &str, name: &str, desc: &str) -> Option<Contract> {
     if perturbed(class, name) {

---- smt_bmc::explore::jdk_allowlist_tests::a_non_null_return_is_claimed_only_where_specified stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::a_non_null_return_is_claimed_only_where_specified' (48825937) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:2034:9:
assertion failed: !ajave_models::returns_nonnull("java/util/Map", "get",
        "(Ljava/lang/Object;)Ljava/lang/Object;")

failures:
    smt_bmc::explore::jdk_allowlist_tests::a_non_null_return_is_claimed_only_where_specified

test result: FAILED. 54 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
