*** crates/ajave-models/src/lib.rs:337:7: replace && with || in returns_nonnull

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace && with || in returns_nonnull
@@ -329,17 +329,17 @@
         | ("java/lang/Object", "toString" | "getClass")
         | ("java/lang/Integer" | "java/lang/Long" | "java/lang/Short"
             | "java/lang/Byte" | "java/lang/Float" | "java/lang/Double"
             | "java/lang/Boolean" | "java/lang/Character",
             "valueOf" | "toString" | "toBinaryString" | "toHexString"
             | "toOctalString")
         | ("java/util/Objects", "requireNonNull" | "toString")
         | ("java/util/Arrays", "asList" | "copyOf" | "copyOfRange" | "toString")
-    ) && !desc.ends_with(")V")
+    ) || /* ~ changed by cargo-mutants ~ */ !desc.ends_with(")V")
 }
 
 pub fn contract_for(class: &str, name: &str, desc: &str) -> Contract {
     contract_of(class, name, desc).unwrap_or(Contract::OPAQUE)
 }
 
 pub fn contract_of(class: &str, name: &str, desc: &str) -> Option<Contract> {
     if perturbed(class, name) {

---- smt_bmc::explore::jdk_allowlist_tests::a_non_null_return_is_claimed_only_where_specified stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::a_non_null_return_is_claimed_only_where_specified' (48832856) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:2034:9:
assertion failed: !ajave_models::returns_nonnull("java/util/Map", "get",
        "(Ljava/lang/Object;)Ljava/lang/Object;")

failures:
    smt_bmc::explore::jdk_allowlist_tests::a_non_null_return_is_claimed_only_where_specified

test result: FAILED. 54 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
