*** crates/ajave-models/src/lib.rs:375:9: delete match arm ("java/lang/String", "contains" | "startsWith" | "endsWith" | "concat" | "equalsIgnoreCase" | "compareTo" | "compareToIgnoreCase" | "indexOf" | "lastIndexOf" | "replace",) in contract_of

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm ("java/lang/String", "contains" | "startsWith" | "endsWith" | "concat" | "equalsIgnoreCase" | "compareTo" | "compareToIgnoreCase" | "indexOf" | "lastIndexOf" | "replace",) in contract_of
@@ -367,33 +367,17 @@
         // The no-argument queries are total.
         (
             "java/lang/String",
             "length" | "isEmpty" | "hashCode" | "toString" | "intern" | "trim" | "toCharArray"
             | "toUpperCase" | "toLowerCase",
         ) => Contract::TOTAL,
         // `equals` is specified null-tolerant; the others throw NPE on null.
         ("java/lang/String", "equals") => Contract::TOTAL,
-        (
-            "java/lang/String",
-            "contains"
-            | "startsWith"
-            | "endsWith"
-            | "concat"
-            | "equalsIgnoreCase"
-            | "compareTo"
-            | "compareToIgnoreCase"
-            | "indexOf"
-            | "lastIndexOf"
-            | "replace",
-        ) => Contract {
-            requires: NN1,
-            effect: Effect::Pure,
-            may_return_null: true,
-        },
+         /* ~ changed by cargo-mutants ~ */
         // Index-bounded accessors.
         ("java/lang/String", "charAt" | "codePointAt") => Contract {
             requires: IDX1,
             effect: Effect::Pure,
             may_return_null: true,
         },
         ("java/lang/String", "substring") => Contract {
             requires: &[Precondition::RangeInBounds {

*** result: Success
