*** crates/ajave-models/src/lib.rs:398:9: delete match arm ("java/lang/String", "substring") in contract_of

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm ("java/lang/String", "substring") in contract_of
@@ -390,25 +390,17 @@
             may_return_null: true,
         },
         // Index-bounded accessors.
         ("java/lang/String", "charAt" | "codePointAt") => Contract {
             requires: IDX1,
             effect: Effect::Pure,
             may_return_null: true,
         },
-        ("java/lang/String", "substring") => Contract {
-            requires: &[Precondition::RangeInBounds {
-                start: 1,
-                end: None,
-                seq: 0,
-            }],
-            effect: Effect::Pure,
-            may_return_null: true,
-        },
+         /* ~ changed by cargo-mutants ~ */
         // PatternSyntaxException / IllegalFormatException are not conditions
         // over the argument values we track.
         (
             "java/lang/String",
             "matches" | "split" | "replaceAll" | "replaceFirst" | "format" | "join",
         ) => Contract {
             requires: OPAQUE,
             effect: Effect::Pure,

*** result: Success
