*** crates/ajave-models/src/lib.rs:443:82: replace == with != in contract_of

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace == with != in contract_of
@@ -435,17 +435,17 @@
             effect: Effect::Unknown,
             may_return_null: true,
         },
         ("java/lang/Object", "<init>" | "getClass" | "hashCode" | "toString" | "equals") => {
             Contract::TOTAL
         }
 
         // ── StringBuilder / StringBuffer ────────────────────────────────
-        ("java/lang/StringBuilder" | "java/lang/StringBuffer", "<init>") if desc == "()V" => {
+        ("java/lang/StringBuilder" | "java/lang/StringBuffer", "<init>") if desc != /* ~ changed by cargo-mutants ~ */ "()V" => {
             Contract::TOTAL_MUT
         }
         ("java/lang/StringBuilder" | "java/lang/StringBuffer", "<init>") => Contract {
             // `StringBuilder(int)` throws on a negative capacity;
             // `StringBuilder(String)` throws NPE on null.
             requires: if desc == "(I)V" {
                 &[Precondition::NonNegative(1)]
             } else {

---- smt_bmc::explore::jdk_allowlist_tests::throwing_signatures_are_not_allowlisted stdout ----

thread 'smt_bmc::explore::jdk_allowlist_tests::throwing_signatures_are_not_allowlisted' (48939544) panicked at crates/ajave-engines/src/smt_bmc/explore.rs:1942:13:
java/lang/StringBuilder.<init>(I)V throws a RuntimeException but is allowlisted as total — that is a reachable wrong TRUE

failures:
    smt_bmc::explore::jdk_allowlist_tests::throwing_signatures_are_not_allowlisted

test result: FAILED. 54 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
