*** crates/ajave-models/src/lib.rs:457:9: delete match arm ("java/lang/StringBuilder" | "java/lang/StringBuffer", "length" | "toString") in contract_of

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm ("java/lang/StringBuilder" | "java/lang/StringBuffer", "length" | "toString") in contract_of
@@ -449,19 +449,17 @@
             requires: if desc == "(I)V" {
                 &[Precondition::NonNegative(1)]
             } else {
                 NN1
             },
             effect: Effect::Receiver,
             may_return_null: true,
         },
-        ("java/lang/StringBuilder" | "java/lang/StringBuffer", "length" | "toString") => {
-            Contract::TOTAL
-        }
+         /* ~ changed by cargo-mutants ~ */
         // `append` renders null as "null" for the reference overloads and is
         // total for the primitive ones.
         ("java/lang/StringBuilder" | "java/lang/StringBuffer", "append") => Contract::TOTAL_MUT,
         ("java/lang/StringBuilder" | "java/lang/StringBuffer", "charAt") => Contract {
             requires: IDX1,
             effect: Effect::Pure,
             may_return_null: true,
         },

*** result: Success
