*** crates/ajave-models/src/lib.rs:462:9: delete match arm ("java/lang/StringBuilder" | "java/lang/StringBuffer", "append") in contract_of

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm ("java/lang/StringBuilder" | "java/lang/StringBuffer", "append") in contract_of
@@ -454,17 +454,17 @@
             effect: Effect::Receiver,
             may_return_null: true,
         },
         ("java/lang/StringBuilder" | "java/lang/StringBuffer", "length" | "toString") => {
             Contract::TOTAL
         }
         // `append` renders null as "null" for the reference overloads and is
         // total for the primitive ones.
-        ("java/lang/StringBuilder" | "java/lang/StringBuffer", "append") => Contract::TOTAL_MUT,
+         /* ~ changed by cargo-mutants ~ */
         ("java/lang/StringBuilder" | "java/lang/StringBuffer", "charAt") => Contract {
             requires: IDX1,
             effect: Effect::Pure,
             may_return_null: true,
         },
 
         // ── Boxing ──────────────────────────────────────────────────────
         (

*** result: Success
