*** crates/ajave-models/src/lib.rs:470:9: delete match arm ("java/lang/Integer" | "java/lang/Long" | "java/lang/Short" | "java/lang/Byte" | "java/lang/Float" | "java/lang/Double" | "java/lang/Character" | "java/lang/Boolean", "valueOf",) in contract_of

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm ("java/lang/Integer" | "java/lang/Long" | "java/lang/Short" | "java/lang/Byte" | "java/lang/Float" | "java/lang/Double" | "java/lang/Character" | "java/lang/Boolean", "valueOf",) in contract_of
@@ -462,39 +462,17 @@
         ("java/lang/StringBuilder" | "java/lang/StringBuffer", "append") => Contract::TOTAL_MUT,
         ("java/lang/StringBuilder" | "java/lang/StringBuffer", "charAt") => Contract {
             requires: IDX1,
             effect: Effect::Pure,
             may_return_null: true,
         },
 
         // ── Boxing ──────────────────────────────────────────────────────
-        (
-            "java/lang/Integer"
-            | "java/lang/Long"
-            | "java/lang/Short"
-            | "java/lang/Byte"
-            | "java/lang/Float"
-            | "java/lang/Double"
-            | "java/lang/Character"
-            | "java/lang/Boolean",
-            "valueOf",
-        ) => {
-            if desc.starts_with("(Ljava/lang/String;)") {
-                // Parsing: NumberFormatException is not a condition over a
-                // value we model.
-                Contract {
-                    requires: OPAQUE,
-                    effect: Effect::Pure,
-                    may_return_null: true,
-                }
-            } else {
-                Contract::TOTAL
-            }
-        }
+         /* ~ changed by cargo-mutants ~ */
         (
             "java/lang/Integer"
             | "java/lang/Long"
             | "java/lang/Short"
             | "java/lang/Byte"
             | "java/lang/Float"
             | "java/lang/Double"
             | "java/lang/Character"

*** result: Success
