*** crates/ajave-models/src/lib.rs:605:9: delete match arm ("java/util/Stack", "pop" | "peek") in contract_of

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm ("java/util/Stack", "pop" | "peek") in contract_of
@@ -597,21 +597,17 @@
             requires: &[Precondition::NonEmpty],
             effect: Effect::Receiver,
             may_return_null: true,
         },
         ("java/util/Iterator" | "java/util/ListIterator", "hasNext" | "hasPrevious") => {
             Contract::TOTAL
         }
         // Stack/Deque removal on an empty receiver throws.
-        ("java/util/Stack", "pop" | "peek") => Contract {
-            requires: &[Precondition::NonEmpty],
-            effect: Effect::Receiver,
-            may_return_null: true,
-        },
+         /* ~ changed by cargo-mutants ~ */
         (
             "java/util/ArrayDeque" | "java/util/LinkedList",
             "pop" | "removeFirst" | "removeLast" | "getFirst" | "getLast",
         ) => Contract {
             requires: &[Precondition::NonEmpty],
             effect: Effect::Receiver,
             may_return_null: true,
         },

*** result: Success
