*** crates/ajave-models/src/lib.rs:696:9: delete match arm ("java/lang/CharSequence", "charAt") in contract_of

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm ("java/lang/CharSequence", "charAt") in contract_of
@@ -688,21 +688,17 @@
         ("java/io/PrintWriter" | "java/io/PrintStream", "format" | "printf") => Contract {
             requires: OPAQUE,
             effect: Effect::Receiver,
             may_return_null: true,
         },
 
         // ── CharSequence ────────────────────────────────────────────────
         ("java/lang/CharSequence", "length" | "toString") => Contract::TOTAL,
-        ("java/lang/CharSequence", "charAt") => Contract {
-            requires: IDX1,
-            effect: Effect::Pure,
-            may_return_null: true,
-        },
+         /* ~ changed by cargo-mutants ~ */
 
         // ── java.util.Objects ───────────────────────────────────────────
         ("java/util/Objects", "requireNonNull") => Contract {
             requires: NN1,
             effect: Effect::Pure,
             may_return_null: true,
         },
         ("java/util/Objects", "equals" | "hashCode" | "toString" | "isNull" | "nonNull") => {

*** result: Success
