*** crates/ajave-models/src/lib.rs:703:9: delete match arm ("java/util/Objects", "requireNonNull") in contract_of

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm ("java/util/Objects", "requireNonNull") in contract_of
@@ -695,21 +695,17 @@
         ("java/lang/CharSequence", "length" | "toString") => Contract::TOTAL,
         ("java/lang/CharSequence", "charAt") => Contract {
             requires: IDX1,
             effect: Effect::Pure,
             may_return_null: true,
         },
 
         // ── java.util.Objects ───────────────────────────────────────────
-        ("java/util/Objects", "requireNonNull") => Contract {
-            requires: NN1,
-            effect: Effect::Pure,
-            may_return_null: true,
-        },
+         /* ~ changed by cargo-mutants ~ */
         ("java/util/Objects", "equals" | "hashCode" | "toString" | "isNull" | "nonNull") => {
             Contract::TOTAL
         }
 
         // ── Threads ─────────────────────────────────────────────────────
         // `start()` runs the thread body, which we do not yet explore, so it
         // must not be treated as total: claiming no runtime exception while
         // never looking inside `run()` is a wrong TRUE. `Unexpressible` is the

*** result: Success
