*** crates/ajave-models/src/lib.rs:812:9: delete match arm b'F' in ret_ty

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm b'F' in ret_ty
@@ -804,17 +804,17 @@
     CollectionIsEmpty,
 }
 
 fn ret_ty(desc: &str) -> Option<Ty> {
     let after = desc.rfind(')')? + 1;
     match desc.as_bytes().get(after)? {
         b'V' => None,
         b'J' => Some(Ty::Long),
-        b'F' => Some(Ty::Float),
+         /* ~ changed by cargo-mutants ~ */
         b'D' => Some(Ty::Double),
         b'L' | b'[' => Some(Ty::Ref),
         _ => Some(Ty::Int),
     }
 }
 
 /// Classes whose instance methods we treat as pure with respect to our state.
 /// String is genuinely immutable. StringBuilder is not, but we never read its

*** result: Success
