*** crates/ajave-models/src/lib.rs:927:13: delete match arm "nondetObject" in model_for

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ delete match arm "nondetObject" in model_for
@@ -919,17 +919,17 @@
 
 pub fn model_for(owner: &str, name: &str, desc: &str) -> CallModel {
     if owner == VERIFIER {
         return match name {
             "assume" => CallModel::Assume,
             "nondetString" => CallModel::Nondet(Some(Ty::Str), b'L'),
             // nondetObject returns a factory-created object; must inline the
             // factory body rather than treating it as a raw nondet ref.
-            "nondetObject" => CallModel::Unmodelled,
+             /* ~ changed by cargo-mutants ~ */
             n if n.starts_with("nondet") => {
                 let jvm_byte = desc
                     .as_bytes()
                     .get(desc.rfind(')').unwrap_or(0) + 1)
                     .copied()
                     .unwrap_or(b'I');
                 CallModel::Nondet(ret_ty(desc), jvm_byte)
             }

*** result: Success
