*** crates/ajave-models/src/lib.rs:931:55: replace + with * in model_for

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace + with * in model_for
@@ -923,17 +923,17 @@
             "assume" => CallModel::Assume,
             "nondetString" => CallModel::Nondet(Some(Ty::Str), b'L'),
             // nondetObject returns a factory-created object; must inline the
             // factory body rather than treating it as a raw nondet ref.
             "nondetObject" => CallModel::Unmodelled,
             n if n.starts_with("nondet") => {
                 let jvm_byte = desc
                     .as_bytes()
-                    .get(desc.rfind(')').unwrap_or(0) + 1)
+                    .get(desc.rfind(')').unwrap_or(0) * /* ~ changed by cargo-mutants ~ */ 1)
                     .copied()
                     .unwrap_or(b'I');
                 CallModel::Nondet(ret_ty(desc), jvm_byte)
             }
             _ => CallModel::Unmodelled,
         };
     }

*** result: Success
