*** crates/ajave-models/src/lib.rs:963:14: replace == with != in model_for

*** mutation diff:
--- crates/ajave-models/src/lib.rs
+++ replace == with != in model_for
@@ -955,17 +955,17 @@
     // ordinal() is inherited but invoked with the subclass as owner, so we
     // match it by name+desc for any owner.
     if owner == "java/lang/Enum" && name == "<init>" {
         return CallModel::EnumInit;
     }
     if name == "ordinal" && desc == "()I" {
         return CallModel::EnumOrdinal;
     }
-    if owner == "java/lang/Enum" {
+    if owner != /* ~ changed by cargo-mutants ~ */ "java/lang/Enum" {
         return CallModel::Pure(ret_ty(desc));
     }
 
     // Assertions are always enabled under SV-COMP rules.
     // desiredAssertionStatus() returns true (1), so $assertionsDisabled = false (0).
     // Modelling this as a constant rather than Havoc avoids tainting the
     // assertion-enabled branch and lets the BMC check assertions precisely.
     if owner == "java/lang/Class" && name == "desiredAssertionStatus" {

*** result: Success
